import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
    
   <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 18 March 2024 </h1>					
                       					
 <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	মেষ রাশি - শত্রুভয় কাটিয়ে উঠতে পারবেন। ব্যবসায় লাভ-ক্ষতি নিয়ে চিন্তা থাকবে। অতিরিক্ত পরিশ্রমের ফলে মানসিক চাপ বৃদ্ধি পাবে। সন্তানদের চাকরির খবর নিয়ে আনন্দ লাভ। আইনজীবীদের জন্য সামনে শুভ সময়। খুব কাছের মানুষের জন্য আপনার ছোটখাটো ক্ষতি হতে পারে। স্ত্রীর সঙ্গে মনোমালিন্যের অবসান হতে পারে। কাজের জন্য ভ্রমণ হতে পারে। পড়াশোনার জন্য ভাল সুযোগ আসতে পারে। মাথার যন্ত্রণা বৃদ্ধি পাবে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	বৃষ রাশি - কাজের ক্ষেত্রে প্রচুর চিন্তা থাকবে। ব্যবসার ব্যাপারে খুব সতর্ক থাকুন, বুদ্ধিভ্রম ঘটতে পারে। বন্ধুদের সঙ্গে বিবাদ। ধর্মালোচনায় সুনাম অর্জন করবেন। বাড়তি উপার্জন হতে পারে। বিলাসিতার জন্য খরচ হতে পারে। শরীরে সমস্যা থাকতে পারে। অতিরিক্ত আবেগ ক্ষতি ডেকে আনতে পারে। চাকরির স্থানে বিবাদ হতে পারে। স্ত্রীর সঙ্গে বিবাদের কারণে মনঃকষ্ট। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	মিথুন রাশি - বাড়িতে অশান্তির কারণে আপনার সম্মানহানি হতে পারে। আপনার বক্তব্য সকলের মন জয় করতে সক্ষম হবে।সঙ্গীতশিল্পীদের শুভ সময়। চাকরিতে বদলির সম্ভাবনা। ব্যবসায় জট ছেড়ে যাওয়ার সম্ভাবনা দেখা যাচ্ছে। ক্রোধ সম্বরণ করা দ্রুত প্রয়োজন। হঠাৎ পুরনো কোনও বন্ধুর সঙ্গে দেখা হতে পারে। সন্তানের জন্য খরচ বাড়তে পারে। সুন্দর কোনও সম্পর্ক নষ্ট হওয়ার সম্ভাবনা রয়েছে। ব্যবসায় আয় বৃদ্ধি পেতে পারে। ভ্রমণের বিষয়ে আলোচনা। বাড়িতে চিকিৎসার খরচ বাড়তে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	কর্কট রাশি - বাড়িতে অশান্তির কারণে আপনার সম্মানহানি হতে পারে। আপনার বক্তব্য সকলের মন জয় করতে সক্ষম হবে। সঙ্গীতশিল্পীদের শুভ সময়। চাকরিতে বদলির সম্ভাবনা। ব্যবসায় জট ছেড়ে যাওয়ার সম্ভাবনা দেখা যাচ্ছে। ক্রোধ সম্বরণ করা দ্রুত প্রয়োজন। হঠাৎ পুরনো কোনও বন্ধুর সঙ্গে দেখা হতে পারে। সন্তানের জন্য খরচ বাড়তে পারে। সুন্দর কোনও সম্পর্ক নষ্ট হওয়ার সম্ভাবনা রয়েছে। ব্যবসায় আয় বৃদ্ধি পেতে পারে। ভ্রমণের বিষয়ে আলোচনা। বাড়িতে চিকিৎসার খরচ বাড়তে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	সিংহ রাশি - কোনও প্রতিযোগিতায় অংশগ্রহণ না করাই ভাল হবে। ভ্রমণে সমস্যা হতে পারে, একটু সাবধান থাকুন।ভাই-বোনের সঙ্গে বিবাদ নিয়ে চিন্তা। শত্রুর সঙ্গে চুক্তিতে কার্যোদ্ধার হতে পারে। প্রেমে নতুন মোড় ঘোরার সম্ভাবনা দেখা যাচ্ছে। নতুন ব্যবসার চেষ্টা করতে পারেন। সারা দিন বেশ উৎফুল্ল কাটলেও বাড়ির লোক আপনাকে বুঝবে না। বাড়ির বড়দের শরীর নিয়ে একটু চিন্তা থাকতে পারে। আপনি আপনার ক্ষমতা দেখানোর সুযোগ পাবেন। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	কন্যা রাশি - অতিরিক্ত বিলাসিতার জন্য খরচ বাড়তে পারে। গুরুজনের সদুপদেশে কর্মে উন্নতি। সন্ধ্যার দিকে কর্মক্ষেত্রে নিজের দোষে সমস্যায় পড়বেন। পরোপকার করতে গিয়ে সংসারে শান্তিভঙ্গ। কোনও সজ্জন ব্যক্তির সান্নিধ্যে সুখ। সন্তানের কাজের ফলে আনন্দ ও গর্ববোধ। বিষয়-সম্পত্তি নিয়ে দুশ্চিন্তা বাড়তে পারে। উচ্চপদের কোনও চাকরির যোগ দেখা যাচ্ছে। বাড়িতে শুভ কাজের জন্য অর্থ খরচ। পায়ের নীচে আঘাত থেকে সাবধান। বুকের কষ্ট বাড়তে পারে। বন্ধুদের কথায় চললে আপনার খুব ক্ষতি হয়ে যেতে পারে। যানবাহন চালনায় বাড়তি সতর্কতা প্রয়োজন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	তুলা রাশি - নিজের ভুল সংশোধন করার ফলে ব্যবসায় দারুণ অর্থপ্রাপ্তির যোগ। গুরুজনের শরীর নিয়ে চিন্তা থাকবে। দূরে ভ্রমণ না করাই ভাল হবে। সমাজে মর্যাদা লাভ হতে পারে। কারও চিকিৎসার কাজে সারা দিন ব্যস্ততা থাকবে। সন্তানের বায়না পূরণ করতে হতে পারে। কোনও সুখবর পেতে পারেন। কোনও পুরনো আশা ভঙ্গ হতে পারে। সন্তানের কোনও ভাল কাজ আপনাকে অবাক করবে। বিনিয়োগী ব্যবসায় ভাল ফল পাওয়া যাবে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	বৃশ্চিক রাশি - কাজের চাপ বাড়তে পারে। বন্ধুর সাহায্যে ব্যবসায় উন্নতি। প্রতিবেশীর সঙ্গে শত্রুতার সম্ভাবনা। ভাল কাজের পরিপেক্ষিতে হতাশা। নতুন ব্যবসায় লগ্নি করতে পারেন, তবে খুব চিন্তা করে এগোবেন। পরিশ্রম বৃদ্ধিতে শারীরিক অসুস্থতার যোগ। মামলায় জড়িয়ে পড়তে পারেন। পিতার সঙ্গে অর্থ নিয়ে তর্ক। কানের সমস্যা বাড়তে পারে। পিতার শরীর নিয়ে একটু ভাবনা হতে পারে। প্রেমে বাধা থাকলেও সঙ্গে আনন্দ থাকবে। বিদ্যার্থীদের নতুন যোগাযোগ আসতে পারে।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	ধনু রাশি - সহকর্মীরা ক্ষোভ প্রকাশ করায় মানসিক চাপ বাড়বে। প্রেমে কষ্ট বাড়তে পারে। সন্তানদের কাজে সাহায্য করতে হতে পারে। ব্যবসায় নতুন কর্মী নিয়োগ করার আগে ভাল করে নজর দিন। বন্ধু সমাগমে আনন্দ লাভ। আপনার সহ্যক্ষমতা আপনাকে বাঁচাবে। কথা খুব কম বলবেন। কোমরের সমস্যা বাড়তে পারে। ভ্রমণের জন্য উৎসাহিত হতে পারেন। স্বামী-স্ত্রীর মধ্যে সুসম্পর্ক বজায় থাকবে। স্বাস্থ্য ভাল যাবে না। অতিরিক্ত রাগ ভাল হবে না।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	মকর রাশি - সব কাজেই সুনাম পেতে পারেন। ব্যবসায় সহকর্মীর দ্বারা ক্ষতির সম্ভাবনা। বাসস্থান কেনাবেচার পরিকল্পনা এখন বন্ধ রাখুন। স্বামী-স্ত্রীর মধ্যে কলহ বাধতে পারে। ছোটখাটো আঘাত লাগতে পারে। আয় ও ব্যয় সমান থাকবে। অযথা তর্কে যাবেন না সমস্যা হতে পারে। পুরনো শত্রুতার জন্য ক্ষতি হওয়ার সম্ভাবনা। পেটের সমস্যা বাড়তে পারে। পিতার শরীর নিয়ে চিন্তা বাড়তে পারে। দুপুরের পরে বিবাদ বৃদ্ধি পাবে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	কুম্ভ রাশি - স্ত্রীর কারণে মন চঞ্চল হতে পারে। কোনও ঝুঁকিপ্রবণ কাজ করতে হতে পরে। বুদ্ধির বলে শত্রুর মোকাবিলা করতে সক্ষম হবেন। বাড়িতে অতিথি সমাগম হতে পারে। দিনের শেষভাগে সম্মানপ্রাপ্তির যোগ। কর্মচারীদের বেপরোয়া আচরণে ব্যবসায় গোলযোগ হতে পারে। নিজের বুদ্ধিতে আইনি সমস্যার হাত থেকে মুক্তি পেতে পারেন। রাস্তায় দুর্ঘটনা ঘটতে পারে। বাড়িতে অতিরিক্ত খরচ বাড়তে পারে। সন্তানের জন্য চিন্তা বাড়তে পারে। ব্যবসায় ক্ষতি হতে পারে। ঠান্ডা লাগা থেকে সাবধান থাকুন।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	মীন রাশি - প্রিয়জনের সঙ্গে বিবাদ নিয়ে চিন্তা হতে পারে। গরিব মানুষের জন্য কিছু করার চেষ্টা করুন। অতিরিক্ত উদাসীনতা কর্মে ব্যাঘাত ঘটাতে পারে। অভিনয় সংক্রান্ত ব্যাপারে জটিলতা আসতে পারে। দাম্পত্য জীবনে অশান্তি বাড়বে। কেনাবেচা করার জন্য দিনটি শুভ। খুব দরকারি কাজ থাকলে দুপুরের পরে করুন। বন্ধুদের কথা মেনে চললে বিপদে পড়তে পারেন। কারও প্রতি আপনার আচরণ খুব খারাপ হতে পারে। ব্যবসায় চাপ বাড়তে পারে। পাওনা আদায় হওয়ার সম্ভাবনা। আগুন থেকে একটু সাবধান থাকুন।	</p>

                    

        </div>
    </div>
  )
}

export default Blog
