import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div>
        

            
    
    <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 21 March 2024 </h1>					
                       					
   <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	কাজ নিয়ে ক্ষোভ বাড়তে পারে। পাওনা আদায় নিয়ে বিবাদ হতে পারে। শত্রুর কবল থেকে মুক্তিলাভ। ধর্মীয় কাজে দান করতে হতে পারে। পারিবারিক বিরোধ অনেক দূর পর্যন্ত যাবে। সকালের দিকে অর্থক্ষতি হতে পারে। ব্যবসা নিয়ে চিন্তা বৃদ্ধি। বন্ধুদের কাছ থেকে সাহায্য পেতে পারেন। পেটের কষ্ট বাড়তে পারে। কর্মচারীর জন্য ব্যবসা বাড়ানোর সুযোগ পেতে পারেন। অতিরিক্ত হঠকারিতার জন্য শরীরে আঘাত লাগতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	কীটপতঙ্গ থেকে একটু সাবধান থাকুন। সংসারে ব্যয় কমানো নিয়ে আলোচনা। শত্রুভয় বাড়তে পারে। ব্যবসার ক্ষেত্রে বুদ্ধির পরিচয় দিতে হবে। কোনও নামী সংস্থায় কাজের ব্যাপারে আলোচনা। ক্রোধ সম্বরণ করতে হবে। সম্পত্তি নিয়ে মা-বাবার সঙ্গে বিবাদ। আইনি কাজে খরচ বৃদ্ধি পাবে। আর্থিক চাপ দেখা দিতে পারে। বাড়ির বাইরে বিবাদ ঘটতে পারে।  কর্মস্থানে আপনাকে অন্যের কথামতো চলতে হতে পারে। আত্মীয়দের কাছ থেকে তেমন কোনও সাহায্য পাবেন না। অপ্রয়োজনীয় কথা বলার জন্য সংসারে বিবাদ হতে পারে। সন্তানদের সঙ্গে কোনও বিষয়ে বিশেষ আলোচনা করতে হতে পারে।   	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	সকালের দিকে শরীরে আঘাত লাগতে পারে। প্রেমের ব্যাপারে শান্তি পেতে পারেন। চিকিৎসার খরচ বৃদ্ধি পাবে। সন্তানের লেখাপড়া নিয়ে চিন্তা বৃদ্ধি পেতে পারে। পেটের সমস্যা হতে পারে। ব্যবসায় ক্ষতি নিয়ে চিন্তা বাড়বে। বাড়তি খরচের জন্য স্ত্রীর সঙ্গে বিবাদ হতে পারে। বুদ্ধিভ্রম হতে পারে। পিতার শরীর নিয়ে কষ্ট বৃদ্ধি পেতে পারে। লোকে দুর্বলতার সুযোগ নিতে পারে। বন্ধুদের দিক থেকে খারাপ কিছু ঘটতে পারে। পিতার জন্য চিন্তা বাড়তে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	কোনও আশা ভঙ্গ হতে পারে। দূরে কোথাও ভ্রমণের ব্যাপারে আলোচনা হতে পারে। সামাজিক কাজের জন্য নাম-যশ বাড়তে পারে। বিদেশে উচ্চশিক্ষার সুযোগ পেতে পারেন। কোনও আত্মীয়েরর জন্য দুশ্চিন্তা হতে পারে। কর্মস্থানে অশান্তি বৃদ্ধি পাবে। একটু একা থাকতে ভাল লাগবে। জমি-বাড়ি কেনার প্রস্তাব আসতে পারে। কর্মস্থানে বিবাদ অনেক দূর যাবে। সংসারের অতিথির কারণে ব্যয় বাড়তে পারে। কাউকে কটুকথা বলায় অনুতপ্ত হতে হবে। লিভারের সমস্যা বাড়তে পারে। ব্যবসায় উন্নতির সুযোগ হাতছাড়া হওয়ার সম্ভাবনা।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	অতিরিক্ত কথায় বাড়িতে বিবাদ। শরীরে কষ্ট বাড়তে পারে। ব্যবসায় শুভ পরিবর্তন। কোনও আত্মীয়ের বাড়িতে ভ্রমণ হতে পারে। প্রেমে আঘাত পেতে পারেন। খেলাধুলায় সাফল্য আসতে পারে। কারও বিবাহের বিষয়ে আনন্দের খবর আসতে পারে। ব্যবসায় আয় বৃদ্ধি পাবে। খরচের জন্য চিন্তা বাড়তে পারে। শেয়ারে অপব্যয় থেকে সাবধান থাকুন। পড়াশোনার জন্য সুনাম পেতে পারেন। প্রতিবেশীর সঙ্গে বিবাদে না যাওয়াই ভাল হবে। সন্তানের জন্য বাড়তি খরচ হতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	শরীরে যন্ত্রণা হতে পারে। প্রেমে বিরহ আসতে পারে। বন্ধুদের থেকে ভাল সাহায্য পাবেন। ব্যবসায় লোকের কাছ থেকে খারাপ ব্যবহার পেতে পারেন। সম্পত্তির ব্যাপারে অশান্তি হতে পারে। সন্তানদের নিয়ে অশান্তি হতে  পারে। বাড়িতে অশান্তির জন্য মন ভাল থাকবে না। রক্তচাপ বাড়তে পারে। পূজাপাঠের জন্য খরচ বাড়তে পারে। আর্থিক চাপ বাড়তে পারে। সংসারের জন্য অনেক করেও বদনাম হতে পারে। স্ত্রীর সঙ্গে তর্ক বাধতে পারে।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	মনের মতো পরিবেশ পেতে পারেন। দাম্পত্য জীবন খুব ভাল কাটতে পারে। কর্মস্থানের পরিবর্তন হতে পারে। বাড়তি খরচের যোগ। কর্মক্ষেত্রে নীতিগত বিবাদ। বন্ধুদের নিয়ে বাড়িতে অশান্তি হতে পারে। খরচ বাড়তে পারে। বাড়িতে খারাপ খবর আসার সম্ভাবনা। মাথার যন্ত্রণা হতে পারে। দুপুরের পরে কারও প্রতি আপনার ব্যবহার খারাপ হতে পারে। ব্যবসায় বাড়তি লাভের আশা না করাই ভাল হবে। প্রিয়জনের কাছ থেকে আঘাত পেতে পারেন। বন্ধুদের সঙ্গে অর্থব্যয়। অতিরিক্ত কথায় অশান্তি বাড়তে পারে।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	সময়ের সঙ্গে একটু তাল মিলিয়ে চলুন। ব্যবসায় ভাল লাভের সময়। কোনও বন্ধুর ব্যাপারে খারাপ কিছু ঘটতে পারে। স্ত্রীর সঙ্গে বিবাদে কোনও ক্ষতি হয়ে যেতে পারে। বাড়িতে বাড়তি খরচের জন্য গুরুজনের সঙ্গে  অশান্তি। প্রেমে আঘাত পেতে পারেন। সন্তানের জন্য চিন্তা ও খরচ বাড়তে পারে। অতিরিক্ত পরিশ্রমে ক্রোধ বৃদ্ধি পেতে পারে। প্রতিবেশীরা আপনাকে সাহায্যের জন্য ডাকতে পারেন। বন্ধুদের জন্য কর্মে ব্যাঘাত ঘটতে পারে। বাড়ির সকলে মিলে ভ্রমণ হতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	নিজের জেদের জন্য কোনও ক্ষতি হতে পারে। সম্পত্তির ব্যাপারে কোনও আত্মীয়ের সঙ্গে বিবাদ বাড়তে পারে। পশুপাখি নিয়ে আনন্দ পেতে পারেন। সংসারের জন্য ব্যয় বাড়তে পারে। ব্যবসায় ভাল সুযোগ কাজে লাগান। চিকিৎসার জন্য খরচ বৃদ্ধি।  শরীরের ক্ষমতা অনুযায়ী কাজ করুন। সংসারে ঝামেলার জন্য পরিবেশ অনুকূল থাকবে না। নতুন কাজের যোগাযোগ হতে পারে। মাথার যন্ত্রণা থেকে সাবধান।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	অভিনয়ের প্রতি অনুরাগ বাড়তে পারে। আয়ের দিক থেকে দিনটি ভাল। বন্ধুদের জন্য কোনও শুভ কাজ সম্ভব হবে। ব্যবসায় নতুন ব্যবস্থা নিতে হতে পারে।  চিকিৎসার খরচ বৃদ্ধি পাবে। চাকরির স্থানে কারও সঙ্গে তর্ক হতে পারে। ব্যবসার ব্যাপারে চিন্তা কমবে। মানসিক কষ্ট পেতে পারেন। প্রেমের জন্য বাড়িতে বিবাদ।  আর্থিক  চাপ বাড়তে পারে। নিজের বুদ্ধির অপপ্রয়োগ না করলে সাফল্য লাভ করবেন। কর্মক্ষেত্রে আপনাকে প্রচুর হিংসার মুখে পড়তে হবে। বিজ্ঞানচর্চার ক্ষেত্রে খুব উপযুক্ত সময়।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	কোনও ভাল কাজ না হওয়ায় মনঃকষ্ট।  নতুন চাকরির চেষ্টা করতে পারেন।আপনার দ্বারা কারও ক্ষতি হওয়ার সম্ভাবনা দেখা যাচ্ছে। সন্তানের ব্যাপারে চাপ বাড়তে পারে। পেটের  কষ্ট বাড়তে পারে। কোনও কাজে সুফল পেতে পারেন। বাড়িতে ভুল কাজ করার জন্য পিতা-মাতার সঙ্গে বিবাদ। ধর্মীয় ব্যাপারে আগ্রহ বাড়তে পারে। ব্যবসায় ফল মধ্যম। পরিশ্রম হবে প্রচুর। বাইরের লোকের জন্য স্বামী-স্ত্রীর মধ্যে অশান্তি হতে পারে। প্রেমের ব্যাপারে চাপ বৃদ্ধি।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	রাজনীতির লোকেদের জন্য ভাল খবর আসতে পারে। সারা দিন কাজ নিয়ে নিয়ে ব্যস্ত থাকতে হবে। অযথা অশান্তি ঘটতে পারে। প্রিয়জনের জন্য মনঃকষ্ট। খরচের ব্যাপারে চিন্তা বাড়তে পারে।  অতিরিক্ত কথা বলার জন্য কর্মস্থানে বিবাদ। ব্যবসায়  লোকের সঙ্গে  তর্ক। সন্তানের জন্য চিন্তা। প্রিয়জনের ক্ষতি হতে পারে। পেটের সমস্যা বৃদ্ধি। দুপুরের পরে ব্যবসা ভাল যাবে, কিন্তু প্রতিযোগিতা বৃদ্ধি পাবে। চাকরিতে প্রচুর কষ্টভোগ। পড়াশোনার খরচ বৃদ্ধি।	</p>

        
    </div>
  )
}



export default Blog


    

