import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
                    <>     
                    <div className='flex flex-col pb-4 leading-loose'>
                      
                        
                        <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 17 March 2024 </h1>					
                       					
 <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	জমি বা সম্পত্তি ক্রয়-বিক্রয় করার শুভ দিন। শেয়ারে বাড়তি লগ্নি চিন্তাবৃদ্ধি ঘটাতে পারে।সন্তানের কাজে গর্ববোধ। পেটের সমস্যায় ভোগান্তি। হাঁটাচলা খুব সাবধানে করবেন। আজ সব কাজের মধ্যেও ধর্মীয় আলোচনায় মন যেতে পারে। শত্রুরা ক্ষতি করতে সফল হবে না। সন্তানদের নিয়ে দুশ্চিন্তা থাকলে কেটে যাবে। বাড়তি কিছু খরচ হতে পারে। আজ বাড়িতে কোনও মাঙ্গলিক কাজের ব্যাপারে আলোচনা হতে পারে। চোখের রোগ বাড়তে পারে। সারা দিন কর্মব্যস্ততার মধ্যে কাটবে। পথে কোনও বিভ্রাটে পড়তে হতে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	বন্ধুদের বিরোধিতা থেকে সাবধান থাকুন। সঞ্চয়ের প্রতি বিশেষ নজর দিন।ভিটামিনের অভাবে শরীরে অনেক রোগ সৃষ্টি হতে পারে। আত্মীয়দের সঙ্গে দেখা করার সুযোগ আসতে পারে। বিদ্যার্থীদের জন্য ভাল সময় নয়। স্ত্রীর বেহিসেবি খরচে সংসারে অশান্তি হতে পারে। নিজের বুদ্ধিতে কর্মস্থানে উন্নতি হতে পারে। যানবাহন বা জমি, কোনও কিছু কেনার আগে ভাবনাচিন্তা করা প্রয়োজন। অতিরিক্ত ক্রোধ আপনার কাজে ব্যাঘাত ঘটাতে পারে। পুলিশি ঝামেলায় যাবেন না। শারীরিক কষ্টের জন্য কাজের ক্ষতি হতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	পেটের সমস্যা বাড়তে পারে। ব্যবসায় আমূল পরিবর্তন লক্ষ করতে পারবেন।সংসারে আর্থিক টানাপড়েন থাকলেও তা মিটে যাবে। সারা দিন নির্ঝঞ্ঝাটে কাটবে। উপার্জনের ভাগ্য ভাল ও আর্থিক উন্নতি বজায় থাকবে। অযথা কোনও ঝামেলায় জড়িয়ে পড়তে পারেন। সন্তানদের নিয়ে চিন্তা বাড়তে পারে। কর্মক্ষেত্রে ভাগ্য আপনার সহায় হবে। নিজের সমস্যার কথা কাউকে না বলাই ভাল। বয়সে ছোট কারও কাছ থেকে উপকার নিতে হতে পারে। সুগারের সমস্যায় ভোগান্তি হতে পারে। বাড়িতে অতিথি আসতে পারেন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	ব্যবসায় বাড়তি বিনিয়োগ না করাই শ্রেয়। মাথাগরম করার ফলে হাতে আসা কাজ ভেস্তে যাবে।পিঠে ব্যথার সমস্যা থাকবে। সারা দিন অক্লান্ত পরিশ্রম করলেও, আর্থিক অবস্থার খুব একটা উন্নতি হবে না। দাম্পত্য জীবন সুখেই কাটবে। বাড়তি কিছু পাওনার আশায় ক্ষতি হতে পারে। সন্তানদের কাছ থেকে সাহায্য পেতে পারেন। দীর্ঘ দিনের অসুখ থেকে মুক্তি পেতে পারেন। পরিবার নিয়ে ভ্রমণ হবে। দুপুরের পরে কোনও ভাল কাজ ব্যর্থ হতে পারে। কর্মে আলস্য দেখালে অনেক ক্ষতি হতে পারে। প্রেমে অশান্তি হতে পারে। নিম্নতন বিদ্যার ক্ষেত্র ভাল নয়।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	ভাই-বোনের কাছ থেকে ভাল সাহায্য পেতে পারেন। মা-বাবার সম্পত্তির ভাগ পেতে পারেন।আজ সব কাজ খুব বিচক্ষণতার সঙ্গে করতে হবে। সামান্য ভুল বড় ক্ষতি ডেকে আনতে পারে। আধ্যাত্মিক আলোচনায় আনন্দ লাভ। ভ্রমণে অযথা হয়রানির যোগ। কাউকে সুপরামর্শ দিতে গেলে অপমানিত হতে পারেন। মা-বাবার সঙ্গে অকারণে ঝামেলা বাধতে পারে। শ্বশুরকুলকে সাহায্য করতে হতে পারে। সন্তানের চাকরিপ্রাপ্তির যোগ দেখা যাচ্ছে। ব্যয় বাড়তে পারে। সারা দিন ব্যবসা গতানুগতিক ভাবেই চলবে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	কোনও নিয়ম লঙ্ঘন করার জন্য আপনাকে বিপদে পড়তে হতে পারে। উচ্চশিক্ষার ক্ষেত্রে শুভ যোগ।বাড়ির সকলকে নিয়ে ভ্রমণ হতে পারে। বৈদ্যুতিক জিনিসপত্র থেকে একটু সাবধান থাকুন। খুব বুঝে না চললে অতিরিক্ত অর্থব্যয় হতে পারে। হঠাৎ কোনও আইনি ঝামেলায় ফেঁসে যেতে পারেন। কাউকে বেশি উদারতা দেখাতে না যাওয়াই ভাল হবে। বাড়ির বয়স্কদের চিকিৎসার জন্য সময় ব্যয় হবে। রক্তপাত থেকে সাবধান থাকুন। সকলের সঙ্গে খুব বুঝে কথা বলুন। কারও কাছ থেকে ব্যবসায় উপকার পেতে পারেন। কোনও উচ্চপদস্থ ব্যক্তির কাছে অকারণে অপমানিত হতে পারেন। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	কোনও ভুল কাজের জন্য অনুতাপ হতে পারে। অতিরিক্ত দৌড়ঝাঁপ করার ফলে অসুস্থ হয়ে পড়তে পারেন।কোনও অসৎ লোকের জন্য আপনার বদনাম হতে পারে। শত্রুরা আপনাকে অপদস্থ করতে পারে। সন্তানদের নিয়ে চিন্তা বৃদ্ধি। কারও সঙ্গে ব্যক্তিগত আলোচনা করতে গেলে অশান্তি হতে পারে। কোনও দামি জিনিস সামলানোর দায়িত্ব আপনার হাতে আসতে পারে। সেবামূলক কাজে আনন্দ লাভ। কুচিন্তার কারণে মনঃকষ্ট। লটারি থেকে কিছু আয় হতে পারে। কোনও ক্ষত থেকে কষ্ট বাড়তে পারে। সকালের দিকে কাজের জন্য বাইরে যেতে হতে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	কারও কুপ্রভাবে সংসারে অশান্তি হতে পারে। সামাজিক সুনাম বা প্রতিপত্তি বিস্তারের যোগ।হারানো কোনও জিনিস উদ্ধার হতে পারে। নৃত্যশিল্পীদের জন্য উন্নতি অপেক্ষা করছে। আজ আপনার খুব কাছের কোনও বন্ধুর দ্বারা বিশেষ উপকৃত হতে পারেন। প্রেমে বিশ্বাস ফিরে আসতে পারে। আপনার মধুর ব্যবহার সকলকে আকৃষ্ট করবে। কোনও জরুরি সিদ্ধান্ত নেওয়ার আগে স্ত্রীর সঙ্গে পরামর্শ করুন। প্রেমের বিবাদ মিটে যেতে পারে। কোমরের নীচের অংশে যন্ত্রণা বাড়তে পারে। ব্যবসার চাপে সংসারে সময় না দেওয়ায় বিবাদ হতে পারে। পুরনো কোনও আশা নষ্ট হতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	সাংসারিক কারণে মানসিক যন্ত্রণা বাড়তে পারে। আজ আপনাকে অবাক করে দেওয়া কোনও সুখবর আসতে পারে।কাউকে টাকা ধার দেবেন না। তর্কবিতর্ক এড়িয়ে চলুন। মায়ের দায়িত্ব পালন না করায় পরিবারে মতান্তর হতে পারে। সঙ্গীতচর্চায় হাল ছাড়লে মুশকিল। উচ্চশিক্ষার ক্ষেত্র খুব প্রতিকূল। অতিরিক্ত ক্রোধের ফলে সংসারে অশান্তির যোগ। গুরুজনদের কথায় বিশেষ মনোযোগ প্রয়োজন। সংসারের ব্যয় বাড়তে পারে। গরিব মানুষের জন্য কিছু করতে পেরে আনন্দ লাভ। ব্যবসায় সুখবর আসতে পারে। রক্তচাপ নিয়ে চিন্তা বাড়তে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	ব্যয় বাড়তে পারে। সম্পত্তি নিয়ে সমস্যা মিটে যেতে পারে।অপরের উপকার করতে গেলে বিপদ হতে পারে। মামলা-মোকদ্দমার যোগ। পরিবারের কাছে সুনাম পাবেন। ক্রয়-বিক্রয়ের কাজে লাভ না-ও হতে পারে। লাগামছাড়া আশায় অর্থব্যয় হতে পারে। ন্যায্য পাওনা আদায় না হওয়ায় নৈরাশ্য। পেটের যন্ত্রণা বাড়তে পারে। মহার্ঘ ভোজনের জন্য খরচ বাড়তে পারে। প্রিয়জনের কাছ থেকে ভালবাসা পাবেন। গাড়িচালকদের জন্য দিনটি শুভ। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	বাত-জাতীয় রোগে কষ্ট পাওয়ার আশঙ্কা। কর্মস্থলে নিজের মতামত প্রকাশ না করাই ভাল হবে।স্ত্রীর কাছ থেকে আঘাত পেতে পারেন। ছোটখাটো রোগকে উপেক্ষা করা ঠিক হবে না। প্রবাসী কেউ বাড়ি ফিরতে পারেন। দুপুরের পরে বাড়তি কোনও আয় হতে পারে। স্ত্রীর সঙ্গে তর্ক না করাই ভাল হবে। ভাল ব্যবহারের দ্বারা অন্যকে প্রভাবিত করতে পারবেন। ইচ্ছাপূরণ হওয়ার দিন। সন্তানের জন্য খরচ বাড়তে পারে। পিতার শরীরের জন্য চিন্তা বৃদ্ধি। ব্যবসায় বিশেষ লাভের শুভ যোগ দেখা যাচ্ছে। দূর দেশে ভ্রমণের পরিকল্পনা সফল হতে পারে। বিদ্যার্থীদের জন্য নতুন কোনও পথ খুলতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	বাড়িতে সবাই খুব সতর্ক থাকুন, চুরির ভয় রয়েছে। অর্থনৈতিক সমস্যার সম্মুখীন হতে হবে।আপনার দ্বারা যে কাজ সম্ভব নয়, সে দিকে যাবেন না। প্রতিকূল পরিবেশ মেনে নিন। সন্তানদের কাজের বিষয়ে কোনও সুখবর আসতে পারে। সারা দিন খুব আলস্যে কাটতে পারে। বিদ্যার্থীদের সুফল পেতে গেলে ধৈর্য ধরতে হবে। আর্থিক লেনদেনের ব্যাপারে সতর্ক থাকুন। নিজের সুবিধার জন্য কোনও কাজ করতে হবে। সপরিবার ভ্রমণ হতে পারে। বাড়তি খরচের জন্য সঞ্চয় কম হবে। ভাল কোনও কাজের জন্য সুনাম লাভ।	</p>

  </div>
                    </>
                    

        </div>
    </div>
  )
}

export default Blog
