import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
                    <>     
                    <div className='flex flex-col pb-4 leading-loose'>
                        
                      <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 15 March 2024 </h1>
                       
   <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	কর্মক্ষেত্রে দায়িত্ব পালন নিয়ে অশান্তি সৃষ্টি হতে পারে। শরীরের সমস্যায় বহু অর্থ ব্যয় হতে পারে।ভ্রমণের পরিকল্পনায় বাধা পড়তে পারে। প্রেমের জট ছেড়ে যাবে। ব্যয়ের প্রতি আজ একটু বেশি নজর দিতে হবে বা সংযত থাকতে হবে। দাম্পত্য জীবনে মতবিরোধ কেটে যাবে। সন্তানের সুবুদ্ধি ঘটতে পারে। কিছু অর্থ হাতে আসার সম্ভাবনা রয়েছে। কোনও প্রভাবশালী ব্যক্তির সাহায্য পাবেন। ব্যবসায় বাধার জন্য মাথাগরম থাকবে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	সম্পত্তি সংক্রান্ত আইনি কাজে সাফল্য পেতে পারেন। বাড়িতে বৈরী মনোভাব ত্যাগ করাই ভাল হবে।স্নেহভাজন কারও সঙ্গে ঝামেলা বাধতে পারে। প্রেমে নতুন মোড় ঘুরবে। ব্যবসায় জটিলতা কাটিয়ে ওঠার ভাল সময়। বাড়িতে অতিথি আগমনের যোগ। নতুন কাজের চিন্তাভাবনা হতে পারে। ঋণ পরিশোধ করার জন্য সঞ্চয়ে ব্যাঘাত ঘটবে। ধর্মীয় কাজে খরচ হতে পারে। ব্যবসায় ভাল কিছু আশা করতে পারেন। স্ত্রীকে নিয়ে চিন্তা থাকবে। ভ্রাতৃবিরোধ বাড়তে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	কোনও বিবাদ হাতাহাতি পর্যন্ত গড়াতে পারে। সারা দিন ব্যবসা ভাল চললেও চিন্তা থাকবে।কারও জিনিসের দায়িত্ব নেবেন না। সম্পত্তি কেনাবেচার শুভ সময়। যানবাহন চড়ার সময় অতিরিক্ত সতর্ক থাকুন। উপার্জনের ভাগ্য ভাল হবে না। সারা দিন সাংসারিক শান্তি বজায় থাকলেও রাতের দিকটা অশুভ। সন্তানদের নিয়ে দুশ্চিন্তা। বাড়তি খরচের জন্য চিন্তা বৃদ্ধি পাবে। প্রিয়জনের প্রতি ঘৃণা বৃদ্ধি পাবে। অনেক দিনের আশা করা বস্তু লাভ হতে পারে। আর্থিক ব্যাপারে ভাল চাপ থাকবে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	সকালের দিকে অশান্তির জন্য মন ভাল থাকবে না। কর্মজগতে জনপ্রিয়তা পেতে পারেন।দেহে খুব ব্যথা সৃষ্টি হতে পারে। কিছু কেনার জন্য অর্থ খরচ। সারা দিন প্রচুর পরিশ্রম হতে পারে। গৃহে মাথা ঠান্ডা রেখে চলতে হবে, পরিস্থিতি বিরুদ্ধে যাওয়ার আশঙ্কা রয়েছে। সংসারে অশান্তি হতে পারে। মা-বাবার সঙ্গে সুসম্পর্ক বজায় থাকবে। কর্মস্থানে আপনার নিন্দা হতে পারে। গবেষণার ক্ষেত্রে ভাল ফলের আশা রয়েছে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	বাড়িতে সুসংবাদ আসতে পারে। নতুন কাজের সন্ধান করতে হতে পারে।সঞ্চয়ে ঘাটতি নিয়ে স্ত্রীর সঙ্গে অশান্তি হতে পারে। প্রতিবাদী মনোভাবে সমাজে সম্মান বৃদ্ধি পেতে পারে। সন্তানদের সঙ্গে সম্পর্ক ভাল থাকবে। কর্মসূত্রে বাড়ির কেউ বাইরে যাওয়ায় মনঃকষ্ট। মাতৃস্থানীয়া কারও সঙ্গে মতবিরোধ হতে পারে। সঙ্গীতচর্চায় নতুন রাস্তা খুলতে পারে। সামাজিক কাজের জন্য সম্মান বৃদ্ধি পাবে। পিতার সম্পত্তি লাভ করতে পারেন। দাম্পত্য কলহের যোগ রয়েছে। কারও চিকিৎসায় খরচ বাড়তে পারে। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	অতিরিক্ত পরিশ্রমে ক্লান্তি আসতে পারে। প্রতিবেশীদের দ্বারা ব্যবসায় উপকার পেতে পারেন।কারও প্ররোচনায় হঠাৎ কোনও কাজে হাত দেবেন না। পারিবারিক অশান্তি মিটে যাওয়ার সঙ্কেত। অতিরিক্ত কথায় ঝামেলার সৃষ্টি হতে পারে। প্রেমের ব্যাপারে খুব সতর্ক থাকতে হবে, প্রতারিত হওয়ার যোগ রয়েছে। মনের কথা বলার জন্য সঠিক মানুষ পাবেন। গুরুজনদের পরামর্শ মেনে চলুন। বাড়িতে চুরি হতে পারে। অযথা ঝামেলায় জড়িয়ে পড়তে পারেন। সন্তানদের নিয়ে চিন্তা থাকলে মিটে যাবে। বাড়তি ব্যবসা নিয়ে দুশ্চিন্তা। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	উদ্বেগের কারণে কোনও কাজ পণ্ড হতে পারে। প্রিয়জনের চিকিৎসায় অর্থ ব্যয় হতে পারে।উচ্চশিক্ষার ব্যাপারে বিশেষ সুযোগ আসতে চলেছে। অকারণে মনে  ভয়ের সৃষ্টি হতে পারে। পথেঘাটে বাড়তি সতর্কতা প্রয়োজন। মনোরম স্থানে ভ্রমণের পরিকল্পনা হতে পারে। সারা দিন আয় ভালই হবে। দাম্পত্য জীবন সুখেই কাটবে। বাড়তি কিছু পাওনার আশায় ক্ষতি হতে পারে। সন্তানদের কাছ থেকে সাহায্য পেতে পারেন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	অপরকে সুখী করতে গেলে আত্মত্যাগ করতে হবে। অভিজ্ঞ ব্যক্তির পরামর্শে আইনি সুরক্ষা পেতে পারেন।প্রতিযোগিতায় জয়ের আশা রাখতে পারেন। কর্মস্থানে নিজের কিছু ভুল শোধরানোর জন্য মিথ্যার আশ্রয় নিতে হবে। দাম্পত্য সম্পর্কে তিক্ততা বাড়বে। কোনও বিশেষ আলোচনা থাকলে সেরে ফেলুন। শারীরিক দুর্বলতায় ভোগান্তির যোগ। বন্ধুদের ব্যবহারে দুঃখ পেতে পারেন। নিজের বুদ্ধিতে কর্মস্থানে উন্নতি। যানবাহন বা জমি কেনার আগে ভাবনাচিন্তার প্রয়োজন রয়েছে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	গান বাজনার  ক্ষেত্রে সুনাম বাড়তে পারে। অতিরিক্ত লোভ আপনার জীবনে বিপদ ডেকে আনতে পারে।নতুন কোনও কাজে না এগোনোই শ্রেয়। চাকরিজীবীদের পদোন্নতির যোগ রয়েছে। শরীর-স্বাস্থ্য ভাল থাকবে। বাড়তি উপার্জন হতে পারে। দানকার্যে আনন্দ লাভ। বাইরের লোকের জন্য সংসারে অশান্তি হতে পারে। জমি বা সম্পত্তি ক্রয়-বিক্রয় করার জন্য ধৈর্য ধরুন। শেয়ারে বাড়তি লগ্নি চিন্তা বৃদ্ধি ঘটাতে পারে। পেটের সমস্যায় ভোগান্তি হতে পারে। হাঁটাচলা খুব সাবধানে করা উচিত।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	বন্ধুদের থেকে একটু সাবধান থাকুন, অশান্তি হতে পারে। অপরের সমালোচনা করতে যাবেন না, সমস্যার সৃষ্টি হতে পারে।সহকর্মীদের মিষ্টি কথায় ভুলবেন না। পুরনো ঝামেলা মিটে যেতে পারে। সারা দিন কর্মে একটু আলস্য থাকলেও সঞ্চয় ভাল হবে। দীর্ঘমেয়াদি কাজ তাড়াতাড়ি সেরে ফেলুন। দর্শনশাস্ত্র চর্চায় স্বীকৃতি বা উন্নতির যোগ দেখা যাচ্ছে। সেবামূলক কাজে শান্তি লাভ। ব্যবসায় বিশেষ লাভের শুভ যোগ দেখা যাচ্ছে। দূর দেশে ভ্রমণের পরিকল্পনা বাতিল হতে পারে। বিদ্যার্থীদের জন্য নতুন পথ খুলতে পারে। বাত-জাতীয় রোগে কষ্ট পাওয়ার সম্ভাবনা রয়েছে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	ব্যবসায় শ্রীবৃদ্ধির যোগ। কারও উপকার করতে গিয়ে অপমানিত হতে হবে।গৃহনির্মাণের শুভ সময় আসছে। দাম্পত্যসুখ বজায় থাকবে। সন্তানের সুবাদে কিছু উপার্জন হতে পারে। বাড়ির বয়স্ক মানুষদের প্রতি বিশেষ নজর দিন। দামি কিছু হারিয়ে যেতে পারে। খুব সতর্ক থাকুন, চুরির ভয় আছে। অর্থনৈতিক সমস্যার সম্মুখীন হতে হবে। প্রতিকূল পরিবেশ মানিয়ে নিন। 	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	কোনও বিশেষ ব্যক্তির দ্বারা সংসারে উন্নতির যোগ দেখা যাচ্ছে। সন্তানদের পরীক্ষার ফল ভাল হবে।শরীরে একটু দুর্বলতা দেখা দিতে পারে। সামাজিক ক্ষেত্রে নিজের দক্ষতা দেখানোর সুযোগ পাবেন। কোনও আত্মীয়ের অসুস্থতার খবর পেতে পারেন। কর্মস্থানে উদাসীনতা আপনার ক্ষতি করবে। রাজনীতির লোকেদের জন্য দিনটি খুব ভাল হবে না। নিকট কেউ শত্রুতা করতে পারেন। বাড়িতে অতিথি আসার যোগ রয়েছে। 	</p>

                           

  </div>
                    </>
                    

        </div>
    </div>
  )
}

export default Blog
