import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
                    <>     
                    <div className='flex flex-col pb-4 leading-loose'>

                       <h1  className='font-semibold text-2xl float-left pr-3'>  মহাশিবরাত্রি সময় - 08/03/2024 </h1>

<p>মহাশিবরাত্রি ব্রতের নিয়ম - শিবরাত্রির আগের দিন নিরামিষ আহার গ্রহণ করে,  রাতে বিছানায় না শুয়ে খড় বা কম্বলে শুতে হয়। ব্রতের দিন উপবাসী থেকে গঙ্গা মাটি বা শুদ্ধ মাটি দিয়ে চারটি শিব গড়ে তাতেই চার প্রহরে একটি করে শিবের পূজা করতে হয়। প্রতিষ্ঠিত শিব থাকলে তাতেই চার প্রহরে চারবার পূজা করতে হয়। প্রথম পহরে দুগ্ধ দ্বারা, দ্বিতীয় প্রহরে দধি দ্বারা, তৃতীয় প্রহরে ঘৃত দ্বারা ও আখের রস দ্বারা ও চতুর্থ প্রহরে মধু ও কুশের জল দ্বারা স্নান করাতে হয়। ব্রতের দিন সারা রাত্রি জাগরণ করে পরদিন ব্রত কথা শুনে, ব্রাহ্মণ ভোজন করিয়ে এবং সাধ্যমত দক্ষিণা দিয়ে পারণ করতে হয়।</p>
<p>  ব্রতের উপকরণ -  গঙ্গা মাটি বা শুদ্ধ মাটি, বিল্বপত্র,  গঙ্গাজল, ফুল, দুগ্ধ, দধি, ঘৃত মধু ও কলা।</p>
<p>   প্রথম প্রহর - সকাল 6 টা থেকে 9 টা। </p>
<p>   দ্বিতীয় প্রহর - সকাল 9 টা থেকে দুপুর 12 টা</p> 
<p>   তৃতীয় প্রহর - দুপুর 12 টা থেকে 3 টা </p>
<p>   চতুর্থ প্রহর - দুপুর 3 টা থেকে 6 টা।</p>
<p>   ব্রতের ফল - যজ্ঞের মধ্যে যেমন অশ্বমেধ যজ্ঞ, তীর্থের মধ্যে যেমন গঙ্গা, তেমনি ব্রতের মধ্যে শ্রেষ্ঠ ব্রত হল শিব চতুর্দশী ব্রত। এই ব্রত পালন করলে ধর্ম, অর্থ, কাম, মোক্ষ চতুর্ভুজ ফল লাভ হয়ে থাকে।</p>
<p>   ব্রতকথা - বহুকাল আগে বারাণসীতে একটি ব্যাধ ছিল। দিনরাত্রি সে শুধু জীব হত্যা করত। একদিন ব্যাধ শিকার করতে গিয়ে অনেক পশুপক্ষী মেরে সন্ধ্যা ঘনিয়ে আসতেই বাড়ির দিকে রওনা হল। কিছুটা এগোতেই রাত্রি হয়ে গেল, অন্ধকার রাত্রি পথ দেখা যায় না। সে তখন এক গাছের নিচে আশ্রয় নিল। কিন্তু গভীর জঙ্গল হিংস্র জন্তু-জানোয়ারের ডাক শুনে সে ভয়ে একটা গাছে উঠে তার ডালে মাংসের ঝোলাটা বেঁধে, সেই ডালে বসে রইল গাছের ডালে বসে রইলো। সেই গাছটি ছিল বেল গাছ, গাছের নিচে ছিল শিবলিঙ্গ। ব্যাধ গাছের ডালে বসে নড়েচড়ে উঠতেই শিশির ভেজা একটি বেলপাতা খসে পড়ল সেই শিবলিঙ্গের মাথায়। সেদিন ছিল শিব চতুর্দশী। ব্যাধ ছিল উপবাসী। তাই শিবের মাথায় বেল পাতা পড়তেই শিব সন্তুষ্ট হলেন। ব্যাধ  কিছুই জানতো না তবু তার শিব চতুর্দশী ব্রতের ফল লাভ হল। সকালে ব্যাধ বাড়ি ফিরে এল। সবাই তার জন্য ভাবছিল, ব্যাধ ফিরে আসতেই তাকে তার বউ খেতে দিল। এমন সময় একজন অতিথি এলে ব্যাধ কি ভেবে তার খাবার গুলি অতিথিকে খেতে দিল। তাতে তার পারণের ফললাভ হল। কিছুদিন বাদে অসুস্থ হয়ে মারা গেল যমদূতরা তাকে নিয়ে যাবার জন্য এলো এমন সময় সেখানে শিবদূতরাও এল দুজনে যুদ্ধ বেঁধে গেল। যমদূতরা হেরে গেল। মৃতদেহ নিয়ে শিবদূতরা কৈলাসের দিকে রওনা হল,  যমদূতরাও তাদের পিছনে পিছনে ধাওয়া করল।  কৈলাসের দ্বারে নন্দী পাহারা দিচ্ছিল সে যমদূতদের কাছে শিব রাত্রির কথা বলল। যমদুতরা ফিরে গিয়ে যমকে সব জানালো। যম বললেন হ্যাঁ যে শিব বা বিষ্ণুর ভক্ত আর যে শিব চতুর্দশী ব্রত করে এবং যে বারানসিধামে মারা যায় তার ওপর আমার কোন অধিকার থাকে না। তারপর থেকে এই ব্রতের কথা চারিদিকে প্রচার হল।
<p>    বি: দ্র: -  হাতে বেল পাতা নিয়ে পাঠ করবেন।</p>
<p>    আপনারা আমাদের মাধ্যমে রুদ্রাভিষেক করাতে পারেন। এই পূজা করলে রোগ থেকে আরোগ্য লাভ , অতুলনীয় ধন্ সম্পত্তি লাভ, এবং মনের মত মনের মানুষ লাভ হয়।</p>
    </p>
                        
                      <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 7 March 2024 </h1>
                       
                         		  <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	 কর্মের জায়গায় চাঞ্চল্যকর পরিস্থিতি, নতুন সুযোগ, পড়াশুনায় মনোযোগী, অর্থহানি, পরিবারে টানাপোড়ন, উদ্বিগ্নতা। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	 যাত্রায় সমস্যা আসবে, তাই সাবধানে করতে হবে যাত্রা। পাড়া, প্রতিবেশী, ভাই, বোন দের সাথে একটু ঝগড়া - অশান্তি দেখাচ্ছে। পিতার শারীরিক সমস্যা। পড়াশুনায় বাধা ও প্রেমে বাধা।  	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	 মোটেই শুভ দিন নয়। অ্যাকসিডেন্ট, ছোটখাটো চোট আঘাত লাগতে পারে। যাত্রায় সাবধান। হঠাৎ অর্থ প্রাপ্তি, ক্যারিয়ারে পরিবর্তন। ইঞ্জিনিয়ারদের জন্য ও ব্যবসায় শুভ। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	 মোটের উপর শুভ। ভাই বন্ধু পাড়া প্রতিবেশী দের সাথে অশান্তি। বাড়িতে চাপা টেনশন। ব্যবসা শুভ। যাত্রা সাবধানে করবেন।  	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	 নতুন সুযোগ আসবে। এন জি ও বা দান ধ্যান করবেন। যারা বিদেশে যাবার চিন্তা করছেন তাদের জন্য ভাল। চাকরির জন্য ভালো। রক্ত চাপ বাড়বে। ব্যপসায় মনোযোগ দেবেন। অর্থ আসবে। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	 প্রেম প্রীতি ভালোবাসায় বাধা। পড়াশুনায় শুভ। শারীরিক ভাবে শুভ। কোর্ট কেস এ জিতবেন। ঝামেলা অশান্তি এড়িয়ে চলবেন। পুজো অর্চনা ভালো হবে।	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	 বাড়িতে চাপা অশান্তি, উত্তেজনা থাকবে। যাত্রা সাবধানে করবেন। বাড়িতে কাজ হবে। জমি কেনা বেচা হবে।	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	 ভাই বোন পাড়া  প্রতিবেশী দের সাথে সুসম্পর্ক, অনেকদিনের পুরনো বন্ধুর সাথে দেখা সাক্ষাৎ হবে। খেলাধুলা ভালো পারফর্ম হবে। এক্টিভ ও প্রচেষ্টা করবেন। ব্যবসায় শুভ। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	 ধনু রাশির জন্য কুটুম আসার সম্ভাবনা বাড়িতে। শশুর বাড়ির লোকেরা বাড়িতে আসতে পারে। খাওয়া দাওয়া বেশ ভালো হবে। বাড়িতে অনুষ্ঠান হতে পারে। পড়াশুনায় ভালো। কেরিয়ার শুভ। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	 উদ্বেগ ও উত্তেজনা থাকবে মনের মধ্যে। নতুন চিন্তা আসবে। ব্যবসা বৃদ্ধি হবে। অর্থ আসবে। প্রচেষ্টা করুন। হঠাৎ রেগে যাবেন না। মোটের ওপর শুভ। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	 খরচা বৃদ্ধি। হাসপাতাল যাবার যোগ দেখাচ্ছে। শরীর স্বাস্থ্য খারাপ বা ডাক্তারের কাছে যেতে হতে পারে। যাত্রায় সাবধান। বাড়িতে উত্তেজনা থাকবে। খরচা হবে। সন্তানের জন্য চিন্তা। পড়াশুনায় শুভ। কেরিয়ার ও বিদেশ যাত্রার জন্য ভাল। 	</p>
                                 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	 মোটের উপর শুভ। এন্টারটেনমেন্ট হবে। খেলা ধুলা ভালো হবে।কোনো ভুল সিদ্ধান্ত নেবেন না। নিজের নিজে না নিয়ে আলোচনা করে নিন। অর্থনৈিকভাবে শুভ। বন্ধু আত্মীয় দের সাথে সময় কাটবে। ব্যবসায় বেশি ইনভেস্ট করবেন না। প্রেম প্রীতি ভালোবাসা শুভ।	</p>


                    </div>
                    </>
                    

        </div>
    </div>
  )
}

export default Blog
