import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
                    <>     
                    <div className='flex flex-col pb-4 leading-loose'>
                        
                      <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 16 March 2024 </h1>
                       
    <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	ছাত্রছাত্রীরা বহুমুখী প্রতিভা দেখানোর সুযোগ পাবেন। নিঃসঙ্গতা আপনাকে তাড়িয়ে বেড়াবে।শারীরিক সমস্যা থেকে মুক্তি পাবেন। ঘরের পরিবেশ অনুকূল থাকলেও বাইরের পরিবেশ তেমন উপযুক্ত হবে না। বাড়ির গুরুজনদের নিয়ে ভ্রমণ হতে পারে। উচ্চশিক্ষায় বাধা পড়তে পারে। প্রেমের ক্ষেত্র খুব শুভপ্রদ। নিজের ধৈর্যের জন্য প্রশংসা পেতে পারেন। সংসারে বা ব্যবসায় বিশেষ পরিবর্তন দেখতে পাবে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	প্রতিবেশীদের সঙ্গে খুব বুদ্ধি নিয়ে চলতে হবে। ঋণের পরিমাণ বাড়তে পারে।মধুর ব্যবহার আপনাকে জনপ্রিয় করে তুলবে। সম্পত্তি রক্ষণাবেক্ষণের দায়িত্ব নিয়ে স্ত্রীর সঙ্গে ঝামেলা। ব্যবসায় লোকের সঙ্গে বিবাদ হতে পারে। সম্মানপ্রাপ্তির যোগ দেখা যাচ্ছে। আত্মীয়দের সঙ্গে মনোমালিন্য। কর্মক্ষেত্রে সহকর্মীদের সঙ্গে মানিয়ে চলতে হবে। দাম্পত্য কলহ বাধার সম্ভাবনা রয়েছে	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	কোনও আধ্যাত্মিক কাজে যোগ দিতে হতে পারে। কর্মক্ষেত্রে কেউ আপনাকে ঠকাতে পারে।সাংসারিক সমস্যা মিটে যাবে। অতিরিক্ত বন্ধুপ্রীতি আপনাকে ভোগাতে পারে। প্রতিবেশীদের চাপে ব্যবসায় ক্ষতি হতে পারে। স্থির মস্তিষ্কে শত্রুর মোকাবিলা করুন। গুরুজনদের স্বাস্থ্যের উন্নতি লক্ষ করা যাবে। সন্তানদের কাজে গর্ববোধ। প্রশাসনিক দায়িত্ব পালনের কাজে ব্যাঘাত ঘটতে পারে। অতিরিক্ত ব্যয় চিন্তায় ফেলতে পারে। পুরনো ব্যথা বাড়তে পারে।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	অতিরিক্ত ক্রোধের জন্য হাতে আসা কাজ পণ্ড হতে পারে। উচ্চশিক্ষার পরিকল্পনা সফল হবে।প্রশাসনিক দায়িত্ব থেকে দূরে থাকাই ভাল হবে। চক্ষুপীড়ার যোগ। কোনও ভাল চিন্তা আপনাকে সারা দিন আচ্ছন্ন রাখবে। ভ্রাতৃবিরোধের যোগ দেখা যাচ্ছে। মামলা-মোকদ্দমা থেকে দূরে থাকাই ভাল। বাড়িতে আত্মীয়ের সমাবেশ হতে পারে। নিজের মেধা প্রকাশের সুযোগ পাবেন। সামাজিক কাজে বেশি না জড়ানোই শ্রেয়, মানহানির আশঙ্কা।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	প্রেমের বিষয়ে খুব ভেবেচিন্তে এগোনো উচিত। শেয়ার বাজারে লাভ দেখা যাচ্ছে, তবে খুব চিন্তা করে বিনিয়োগ করুন। কর্মদক্ষতায় চাকরির স্থানে সুনাম অর্জন করতে পারবেন। বিষয়-সম্পত্তি নিয়ে সংসারে অশান্তি। যে কোনও কাজের চেষ্টা করতে পারেন, ফল শুভ হবে। বাড়িতে কারও বিয়ে নিয়ে আলোচনা হতে পারে। সন্তানদের সঙ্গে ভাল ব্যবহার বজায় রেখে চলুন। রাস্তায় ছোটখাটো আঘাত লাগতে পারে।  	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	স্ত্রীর জন্য বিশেষ কাজের সুযোগ পাবেন। কোনও দুঃস্থ ব্যক্তির পাশে দাঁড়াতে হতে পারে।নানা ধরনের শারীরিক অসুস্থতার যোগ। গৃহনির্মাণে বাধা পড়তে পারে। সপরিবার ভ্রমণ হতে পারে। যানবাহন চালানোয় বাড়তি সতর্কতা বজায় রাখুন। কর্মক্ষেত্রে বদলির সম্ভাবনা। নিজের কৌশলে ব্যবসায় উন্নতির যোগ।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	মাতৃস্থানীয়া কারও সঙ্গে মতবিরোধ হতে পারে। সঙ্গীতচর্চায় নতুন রাস্তা খুলতে পারে।পরিশ্রমের সুফল পাবেন। প্রতিবেশীর দ্বারা ব্যবসায় উপকার পেতে পারেন। কারও প্ররোচনায় হঠাৎ কোনও কাজে হাত দিয়ে দেবেন না। পারিবারিক অশান্তি মিটে যাওয়ার সঙ্কেত। অতিরিক্ত কথা বলায় বিবাদের যোগ। পেটের সমস্যা একটু থাকবে। কর্মস্থানে পরিস্থিতির সঙ্গে নিজেকে মানিয়ে নিন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	কোনও ভাল জিনিস নষ্ট হওয়ার যোগ। বন্ধুদের দিক থেকে ক্ষতি হতে পারে।ব্যবসায় দুশ্চিন্তা বৃদ্ধি। আপনার কোনও আচরণ লোকের খারাপ লাগতে পারে। শরীরে যন্ত্রণা বৃদ্ধি। ব্যবসায় কোনও নতুন কাজের শুভ সূচনা। শত্রুভয় বাড়তে পারে। চাকরির স্থানে কোনও মহিলার সঙ্গে নতুন ভাবে বন্ধুত্ব শুরু হতে পারে। কাজের জায়গায় সুনাম বৃদ্ধি পাবে। দীর্ঘ দিনের কোনও ইচ্ছা পূরণ হতে পারে। সন্তানদের জন্য স্ত্রীর সঙ্গে মনোমালিন্য। কোনও জটিল সমস্যা আপনাকে ভোগাতে পারে।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	 অভিজ্ঞ ব্যক্তির পরামর্শে আইনি সুরক্ষা পেতে পারেন। প্রতিযোগিতামূলক কাজে জয়ের আশা রাখতে পারেন। কর্মস্থানে নিজের কিছু ভুল শোধরানোর জন্য মিথ্যার আশ্রয় নিতে হবে। স্বামী-স্ত্রীর সম্পর্কের মধ্যে রুক্ষতা বাড়বে। বিশেষ কোনও আলোচনা থাকলে সেরে ফেলুন। শারীরিক দুর্বলতায় ভোগান্তি। কর্মস্থানে ভাল পরিকল্পনার জন্য সুনাম বাড়তে পারে। গুরুজনের কথায় বিশেষ মনোযোগ দেওয়া প্রয়োজন। বিশেষ কোনও কাজের সুযোগ আসতে পারে। পারিবারিক দায়িত্ব পালনে সক্ষম হবেন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	ধর্ম বিষয়ক আলোচনায় সুনাম বৃদ্ধি পাবে। মাত্রাছাড়া আবেগ আপনার ক্ষতি ডেকে আনতে পারে। কর্মক্ষেত্রে জটিলতা দূর হবে। প্রিয় কোনও বন্ধুর সঙ্গে দেখা হতে পারে। খাদ্যের প্রতি লোভ সামলাতে না পারলে শারীরিক সমস্যা হতে পারে। বন্ধুদের কারণে কোথাও সম্মানিত হতে পারেন। ব্যবসার ব্যাপারে মনোবল বাড়ান। কাউকে পরামর্শ না দেওয়াই ভাল হবে। হতাশার জন্য শরীর খারাপ হওয়ার সম্ভাবনা। মানুষের সেবায় শান্তিলাভ। গুরুত্বপূর্ণ কাজে বিপত্তি ঘটতে পারে। দাম্পত্য জীবনে হঠাৎ করে অশান্তি শুরু হতে পারে।   	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	 কর্মক্ষেত্রে দায়িত্ব পালন নিয়ে সমস্যা হতে পারে। চিকিৎসার ব্যাপারে বহু অর্থ ব্যয় হতে পারে।ভ্রমণের পরিকল্পনায় বাধা আসতে  পারে। প্রেমের জট ছেড়ে যাবে। ব্যয়ের প্রতি একটু বেশি নজর দিতে হবে। স্ত্রীর সঙ্গে মতবিরোধ কেটে যাবে। সন্তানের সুবুদ্ধি ঘটতে পারে। মামলা-মোকদ্দমা থেকে নিজেকে বাঁচিয়ে চলাই ভাল। সাংসারিক শান্তি বজায় থাকবে। পুরনো শত্রুর কাছ থেকে বন্ধুর মতো ব্যবহার পাবেন।	</p>
 <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	 সকলের সঙ্গে কথা খুব বুঝে বলবেন। সন্তানদের নিয়ে সংসারে কলহ সৃষ্টি হতে পারে।আইনি সমস্যায় পড়তে পারেন। প্রতিভা প্রকাশের বিশেষ দিন। মনে মনে কোনও ভয় আপনার বুদ্ধিনাশ করতে পারে। আবেগের বশে কাজ করলে বিপদ হতে পারে। আমাশয়-জাতীয় রোগে কষ্ট পেতে পারেন। বাড়ির পরিবেশ আপনার অনুকূল থাকবে। বাড়ির বড়দের শরীর নিয়ে একটু চিন্তা থাকতে পারে। উচ্চশিক্ষার ব্যাপারে বিশেষ সুযোগ আসতে পারে।	</p>


  </div>
                    </>
                    

        </div>
    </div>
  )
}

export default Blog
