import React, { useState, useEffect } from 'react'
import appwriteService from '../appwrite/config'

function Blog() {
    const [blog, setBlog] = useState([])
    const [loader, setLoader] = useState(true)
    

    const blogData = async() => {
        try {
            const data = await appwriteService.getBlogData();
            if(data) {
                if(data.total > 0) {
                    setBlog(data.documents);
                    setLoader(false)
                } else {
                    alert("New Predictions Are Being Uploaded")
                } 
            }
        } catch (error) {
            alert(error)
        }
    }

    useEffect(() => {
      blogData()
    }, [])

    const BlogDate = (date) => {
        const currentDate = new Date(date.date);
        const day = currentDate.getDate();
        const month = currentDate.getMonth() + 1;
        const year = currentDate.getFullYear();
        const formattedDate = (day < 10 ? '0' : '') + day + '/' + (month < 10 ? '0' : '') + month + '/' + year;
        return <span>{`${formattedDate}`}</span>
    }
    
  return (
    <div className='w-full h-auto py-2 px-2'>
        <div className='my-10'>

            
                    <>     
                    <div className='flex flex-col pb-4 leading-loose'>

                       <h1  className='font-semibold text-2xl float-left pr-3'>  মহাশিবরাত্রি সময় - 08/03/2024 </h1>

<p>মহাশিবরাত্রি ব্রতের নিয়ম - শিবরাত্রির আগের দিন নিরামিষ আহার গ্রহণ করে,  রাতে বিছানায় না শুয়ে খড় বা কম্বলে শুতে হয়। ব্রতের দিন উপবাসী থেকে গঙ্গা মাটি বা শুদ্ধ মাটি দিয়ে চারটি শিব গড়ে তাতেই চার প্রহরে একটি করে শিবের পূজা করতে হয়। প্রতিষ্ঠিত শিব থাকলে তাতেই চার প্রহরে চারবার পূজা করতে হয়। প্রথম পহরে দুগ্ধ দ্বারা, দ্বিতীয় প্রহরে দধি দ্বারা, তৃতীয় প্রহরে ঘৃত দ্বারা ও আখের রস দ্বারা ও চতুর্থ প্রহরে মধু ও কুশের জল দ্বারা স্নান করাতে হয়। ব্রতের দিন সারা রাত্রি জাগরণ করে পরদিন ব্রত কথা শুনে, ব্রাহ্মণ ভোজন করিয়ে এবং সাধ্যমত দক্ষিণা দিয়ে পারণ করতে হয়।</p>
<p>  ব্রতের উপকরণ -  গঙ্গা মাটি বা শুদ্ধ মাটি, বিল্বপত্র,  গঙ্গাজল, ফুল, দুগ্ধ, দধি, ঘৃত মধু ও কলা।</p>
<p>   প্রথম প্রহর - সকাল 6 টা থেকে 9 টা। </p>
<p>   দ্বিতীয় প্রহর - সকাল 9 টা থেকে দুপুর 12 টা</p> 
<p>   তৃতীয় প্রহর - দুপুর 12 টা থেকে 3 টা </p>
<p>   চতুর্থ প্রহর - দুপুর 3 টা থেকে 6 টা।</p>
<p>   ব্রতের ফল - যজ্ঞের মধ্যে যেমন অশ্বমেধ যজ্ঞ, তীর্থের মধ্যে যেমন গঙ্গা, তেমনি ব্রতের মধ্যে শ্রেষ্ঠ ব্রত হল শিব চতুর্দশী ব্রত। এই ব্রত পালন করলে ধর্ম, অর্থ, কাম, মোক্ষ চতুর্ভুজ ফল লাভ হয়ে থাকে।</p>
<p>   ব্রতকথা - বহুকাল আগে বারাণসীতে একটি ব্যাধ ছিল। দিনরাত্রি সে শুধু জীব হত্যা করত। একদিন ব্যাধ শিকার করতে গিয়ে অনেক পশুপক্ষী মেরে সন্ধ্যা ঘনিয়ে আসতেই বাড়ির দিকে রওনা হল। কিছুটা এগোতেই রাত্রি হয়ে গেল, অন্ধকার রাত্রি পথ দেখা যায় না। সে তখন এক গাছের নিচে আশ্রয় নিল। কিন্তু গভীর জঙ্গল হিংস্র জন্তু-জানোয়ারের ডাক শুনে সে ভয়ে একটা গাছে উঠে তার ডালে মাংসের ঝোলাটা বেঁধে, সেই ডালে বসে রইল গাছের ডালে বসে রইলো। সেই গাছটি ছিল বেল গাছ, গাছের নিচে ছিল শিবলিঙ্গ। ব্যাধ গাছের ডালে বসে নড়েচড়ে উঠতেই শিশির ভেজা একটি বেলপাতা খসে পড়ল সেই শিবলিঙ্গের মাথায়। সেদিন ছিল শিব চতুর্দশী। ব্যাধ ছিল উপবাসী। তাই শিবের মাথায় বেল পাতা পড়তেই শিব সন্তুষ্ট হলেন। ব্যাধ  কিছুই জানতো না তবু তার শিব চতুর্দশী ব্রতের ফল লাভ হল। সকালে ব্যাধ বাড়ি ফিরে এল। সবাই তার জন্য ভাবছিল, ব্যাধ ফিরে আসতেই তাকে তার বউ খেতে দিল। এমন সময় একজন অতিথি এলে ব্যাধ কি ভেবে তার খাবার গুলি অতিথিকে খেতে দিল। তাতে তার পারণের ফললাভ হল। কিছুদিন বাদে অসুস্থ হয়ে মারা গেল যমদূতরা তাকে নিয়ে যাবার জন্য এলো এমন সময় সেখানে শিবদূতরাও এল দুজনে যুদ্ধ বেঁধে গেল। যমদূতরা হেরে গেল। মৃতদেহ নিয়ে শিবদূতরা কৈলাসের দিকে রওনা হল,  যমদূতরাও তাদের পিছনে পিছনে ধাওয়া করল।  কৈলাসের দ্বারে নন্দী পাহারা দিচ্ছিল সে যমদূতদের কাছে শিব রাত্রির কথা বলল। যমদুতরা ফিরে গিয়ে যমকে সব জানালো। যম বললেন হ্যাঁ যে শিব বা বিষ্ণুর ভক্ত আর যে শিব চতুর্দশী ব্রত করে এবং যে বারানসিধামে মারা যায় তার ওপর আমার কোন অধিকার থাকে না। তারপর থেকে এই ব্রতের কথা চারিদিকে প্রচার হল।
<p>    বি: দ্র: -  হাতে বেল পাতা নিয়ে পাঠ করবেন।</p>
<p>    আপনারা আমাদের মাধ্যমে রুদ্রাভিষেক করাতে পারেন। এই পূজা করলে রোগ থেকে আরোগ্য লাভ , অতুলনীয় ধন্ সম্পত্তি লাভ, এবং মনের মত মনের মানুষ লাভ হয়।</p>
    </p>
                        
                      <h1  className='font-semibold text-2xl float-left pr-3'> Ajker Rashifal: বাঙালি দৈনিক রাশিফল - 8 March 2024 </h1>
                       
                         		   <h1 className='font-semibold text-2xl float-left pr-2'>	মেষ রাশি 	</h1>	<p>	 শুভ দিন। বন্ধু বান্ধবের সাথে সাক্ষাৎ, মনের ইচ্ছা পূরণ হবে। প্রেমের দিক ও চাকুরীর দিক থেকে শুভ। পড়াশুনায় শুভ। যাত্রায় শুভ। খরচা হবে।  	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	বৃষ রাশি 	</h1>	<p>	 কেরিয়ার এ উন্নতি। নতুন সুযোগ ও বিদেশ যাত্রার যোগ। বন্ধু বান্ধবের সাথে মনোমালিন্য, পড়াশোনায় শুভ। প্রেমে সন্দেহ প্রবণতা। যাত্রা শুভ। অর্থ আগমন। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	মিথুন রাশি 	</h1>	<p>	 যাত্রা শুভ। উচ্চ শিক্ষায় ভালো, পড়াশুনা ভালো। চেষ্টা বৃদ্ধি। সন্তানের দিক শুভ। রিওয়ার্ড পাবেন। যাত্রা হবে। বাড়ি পরিবর্তন হতে পারে। নতুন জায়গায় যাবেন। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	কর্কট রাশি 	</h1>	<p>	 একটু সমস্যা যুক্ত দিন। হঠাৎ অর্থ নাশ। শারীরিক সমস্যা। মোটের উপর পড়াশুনায় শুভ। যাত্রা সাবধান। কেরিয়ার এ ও ব্যবসায় সুযোগ। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	সিংহ রাশি 	</h1>	<p>	 শুভ দিন। ব্যবসা ও পার্টনারশিপ ব্যবসার জন্য শুভ। খরচা হবে। পড়াশুনায় মনোযোগী হোন। যাত্রায় শুভ। কেরিয়ার এ সুযোগ আসবে এবং নতুন চাকরি হবে। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	কন্যা রাশি 	</h1>	<p>	 চাকরির জন্য খুবই ভালো। কম্পিটিটিভ পরীক্ষার জন্য খুব ভালো। শারীরিক সমস্যা। অর্থের দিক থেকে চাপা অশান্তি। ব্যবসা ও ট্রেডিংয়ে বেশি রিস্ক নেবেন না। যাত্রায় শুভ। মামা মাসী পিসির বাড়ি যাবেন। সন্তান নিয়ে চিন্তা। পড়াশুনায় ভালো। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	তুলা রাশি 	</h1>	<p>	 পড়াশুনা ভালো হবে। প্রেমে ইগো ত্যাগ করতে হবে। ব্যবসায় ভালো। নার্ভাস ও গায়নো গত সমস্যা দেখা দিতে পারে। চাকরি পরিবর্তন হবে। প্রসাধনী ও জায়গা জমি সংক্রান্ত ব্যবসায় উন্নতি। অর্থ শুভ। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	বৃশ্চিক রাশি 	</h1>	<p>	 মোটামুটি শুভ। বাড়িতে কোনো অনুষ্ঠান হবে। কুটুম আসবে।মাতার সুখ পাবেন। সরকারি চাকুরি পাবার যোগ। যাত্রা ভালো। ভাই বন্ধু দের সাথে ভালো সম্পর্ক। প্রেমে ব্যাঘাত আসতে পারে। শারীরিক সচেতন হবেন। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	ধনু রাশি 	</h1>	<p>	 যাত্রা হবে। নিজের প্রচেষ্টার দ্বারা উন্নতির চেষ্টা থাকবে একটা। ভাই বন্ধু দের সাথে ভালো সম্পর্ক। অর্থনৈতিক ভাবে শুভ। সন্তান প্রাপ্তি যোগ। পড়াশুনায় ভালো। চাকুরীর জায়গায় চাপা উত্তেজনা। বাড়িতে চাপা অশান্তি। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	মকর রাশি 	</h1>	<p>	 রাগ আসতে পারে। দাম্পত্য জীবনে কলহ আসতে পারে। হঠাৎ করে ইচ্ছা পূর্তি করবেন। বাড়িতে উত্তেজনা। অর্থনৈতিক ভাবে শুভ। বাড়ি কিনতে পারে। পড়াশুনায় ভালো। জবের জায়গা ভালো। ভাই বন্ধুদের সাথে অশান্তি। কোনো সিদ্ধান্ত বুঝে নিন। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	কুম্ভ রাশি 	</h1>	<p>	 চাপা উত্তেজনা কমবে। সুখ সামগ্রীর জিনিস কিনতে পারেন। পরিবারের লোক দুঃখ চিন্তা একটু থাকবে আবার আনন্দ আসবে। টাকা পাবেন। কেরিয়ার এ শুভ। ব্যবসা ও পড়াশুনায় ভালো। সন্তানের চোট আঘাত লাগতে পারে। 	</p>
                         <h1 className='font-semibold text-2xl float-left pr-2'>	মীন রাশি 	</h1>	<p>	 ভালো দিন। বিদেশ যাত্রা হবে। ইমপোর্ট এক্সপোর্ট এর ব্যবসা শুভ। খরচা বাড়বে ভালো কাজে। টাকা আসবে । সিদ্ধান্ত বুঝে নিন। ট্রেডিং করবেন না। কোনো জায়গায় ফিক্সড ডিপোজিট করুন। দাম্পত্য জীবন এ সমস্যা। সন্তান অমনোযোগী।	</p>


                    </div>
                    </>
                    

        </div>
    </div>
  )
}

export default Blog
